export const DISCDescription = {
  Tiger:
    "「老虎型」的人格特質就是相當積極、有企圖心、喜歡掌控局勢、不拘泥於現況且行動力強，相當具有領導風範。優點在於能夠綜觀大局、做事情非常果斷，且可以擔起重任；而缺點則是在工作決策上較容易過於專制，不容易妥協於他人的建議，可能會造成團隊間的衝突摩擦。",
  Peacock:
    "「孔雀型」的人格特質就如孔雀般的光采洋溢，其主要擅於拓展人際關係、愛交朋友、為人熱情，良好社交手腕是他的一大武器，同時富有同理心，通常是「社交達人」的角色。優點在於他們的「活潑」，能夠作為同事之間順暢溝通的媒介，容易與團隊搞好關係來達成目標；而缺點則是時常會有「超出框架」的思維，對於大局掌控及細節較無法做到位。",
  KoalaBear:
    "「無尾熊型」的人格特質給人一種穩重、行事拘謹不浮誇的感覺，同時他們的性格較為溫和、怕麻煩，所以不會是團隊中的出頭鳥，多數時刻為團隊中默默做自己事情的人。優點在於他們做事中規中矩，不會追求華麗浮誇的作法，同時為人和善，擅於與他人合作，並保持良好合作氛圍；缺點則是缺少快速判斷時局的決策力，對於意見相佐時容易妥協去迎合對方，可能造成自己的做事原則出現違背之時，使整體工作效率下降。",
  Owl: "「貓頭鷹型」的人格特質為分析能力極強，對於各種數據上的掌握度高且精準，是會以品質為優先考量的特質，而他條理分明的特質，容易以邏輯道理說服身邊的人，但其思維較為保守，常會以客觀的角度及堅持來反駁創新突破的思維。優點在於他們做事中規中矩，不會追求華麗浮誇的作法，同時為人和善，擅於與他人合作，並保持良好合作氛圍；缺點則是缺少快速判斷時局的決策力，對於意見相佐時容易妥協去迎合對方，可能造成自己的做事原則出現違背之時，使整體工作效率下降。",
  Chameleon:
    "「變色龍型」的人格特質講究「中庸之道」，對於任何事情都抱持著可接受的態度，適應性及抗壓性非常高，同時待人處事也相對隨和，可以快速融入於團體之中，展現自身卓越的察言觀色能力。優點在於他的適應能力極高，可以在團隊中隨時調整自己的角色定位，同時溝通能力也好，能夠妥善地處理團隊合作項目，自在地融入到團隊中；而缺點則是沒有明確的「突出點」，加上善變的特質，使得有時候做決定時會優柔寡斷，顧慮太多而錯過良好機會，缺乏對於某些事物的堅持。",
};

export const DISCJobRecommend = {
  Tiger: "業務經理、企業家、將軍、創業者、海外事業部經理、指揮、導演、警察",
  Peacock: "演員、領隊、講師、表演藝術者、業務、主持人、廣告創意、政客",
  KoalaBear:
    "師字輩 - 教授、工程師、醫師、律師、會計師、精算師、顧問、老師、科學家、殯葬業、宗教相關。",
  Owl: "公務員、作業員、餐飲服務、傳產技術員、社工、行政秘書、非營利組織、客服人員",
  Chameleon: "創新技術開發人員、各種項目皆可嘗試",
};
