import React from 'react';



export const Description = {
 ESTJ:'講求實際，注重現實，注重事實。果斷，很快作出實際可行的決定。善於將項目和人組織起來將事情完成，並盡可能以最有效率的方法達到目的。能夠注意日常例行工作的細節。有一套清晰的邏輯標準，有系統性地遵循， 並希望他人也同樣遵循。會以較強硬的態度去執行計劃。',
 ESTP:'靈活、忍耐力強，實際，注重結果。覺得理論和抽象的解釋非常無趣。喜歡積極地採取行動解決問題。注重當前，自然不做作，享受和他人在一起的時刻。喜歡物質享受和時尚。學習新事物最有效的方式是通過親身感受和 練習。',
 ESFJ:'有愛心、有責任心、合作。希望周邊的環境溫馨而和諧，並為此果斷地營造這樣的環境。喜歡和他人一起精確並及時地完成任務。忠誠，即使在細微的事情上也如此。能體察到他人在日常生活中的所需並竭盡全力幫助。希望自己和自己的所為能受到他人的認可和賞識。',
 ESFP:'外向，友善，包容。熱愛生活、人類和物質上的享受。喜歡與別人共事。在工作上，講究常識和實用性，注意現實的情況，使工作富趣味性。富靈活性、即興性，自然不做作，易接受新朋友和適應新環境。與別人一起學習 新技能可以達到最佳的學習效果。',
 ENTP:'反應快、叡智，有激勵別人的能力，警覺性強、直言不諱。在解決新的、具有挑戰性的問題時機智而有策略。善於找出理論上的可能性，然後再用戰略的眼光分析。善於理解別人。不喜歡例行公事，很少會用相同的方法做相同的事情，傾向於一個接一個的發展新的愛好。',
 ENFJ:'溫情，有同情心，反應敏捷，有責任感。非常關注別人的情緒、需要和動機。善於發現他人的潛能，並希望能幫助他們實現。能夠成為個人或群體成長和進步的催化劑。忠誠，對讚美和批評都能做出積極地回應。友善、好 社交。在團體中能很好地幫助他人，並有鼓舞他人的領導能力。',
 ENFP:'熱情洋溢、富有想象力。認為生活是充滿很多可能性。能很快地將事情和信息聯系起來，然後很自信地根據自己的判斷解決問題。很需要別人的肯定，又樂於欣賞和支持別人。靈活、自然不做作，有很強的即興發揮的能力 ，言語流暢。',
 ISTJ:'沉靜，認真；貫徹始終、得人信賴而取得成功。講求實際，注重事實和有責任感。能夠合情合理地去決定應做的事情，而且堅定不移地把它完成，不會因外界事物而分散精神。以做事有次序、有條理為樂─不論在工作上， 家庭上或者生活上。重視傳統和忠誠。',
 ISTP:'容忍，有彈性；是冷靜的觀察者，但當有問題出現，便迅速行動，找出可行的解決方 法。能夠分析哪些東西可以使事情進行順利，又能夠從大量資料中，找出實際問題的重心。很重視事件的前因後果，能夠以理性的原則把事實組織起來，重視效率。',
 ISFJ:'沉靜，友善，有責任感和謹慎。能堅定不移地承擔責任。做事貫徹始終、不辭勞苦和準確無誤。忠誠，替人著想，細心；往往記著他所重視的人的種種微小事情，關 心別人的感受。努力創造一個有秩序、和諧的工作和家居 環境。',
 ISFP:'沉靜，友善，敏感和仁慈。欣賞目前和他們週遭所發生的事情。喜歡有自己的空間，做事又能把握自己的時間。忠於自己的價值觀，忠於自己所重視的人。不喜歡爭 論和衝突，不會強迫別人接受自己的意見或價值觀。',
 INTJ:'在實現自己的想法和達成自己的目標時有創新的想法和非凡的動力。能很快洞察到外界事物間的規律並形成長期的遠景計劃。一旦決定做一件事就會開始規劃並直到完成為止。多疑、獨立，對於自己和他人能力和表現的要求都非常高。',
 INTP:'對任何感興趣的事物，都要探索一個合理的解釋。喜歡理論和抽象的事情，喜歡理念思維多於社交活動。沉靜，滿足，有彈性，適應力強。在他們感興趣的範疇內，有非凡的能力去專注而深入地解決問題。有懷疑精神，有 時喜歡批判，常常善於分析。',
 INFJ:'尋求思想、關系、物質等之間的意義和聯系。希望了解什麼能夠激勵人，對人有很強的洞察力。有責任心，堅持自己的價值觀。對於怎樣更好的服務大眾有清晰的遠景。在對於目標的實現過程中有計劃而且果斷堅定。',
 INFP:'理想主義者，忠於自己的價值觀及自己所重視的人。外在的生活與內在的價值觀配合，有好奇心，很快看到事情的可能與否，能夠加速對理念的實踐。試圖瞭解別 人、協助別人發展潛能。適應力強，有彈性；如果和他們的 價值觀沒有牴觸，往往能包容他人。',

};

export const JobRecommend = {
  ESTJ:'無特定',
  ESTP:'貿易、商業、某些特殊領域、服務業、金融證券業、娛樂、體育、藝術領域',
  ESFJ:'無特定',
  ESFP:'消費類商業、服務業領域 廣告業、娛樂業領域 旅遊業、社區服務',
  ENTJ:'工商業、政界、金融和投資領域、管理咨詢、培訓、專業性領域',
  ENTP:'投資顧問、項目策劃、投資銀行、自我創業、市場營銷、創造性領域、公共關系、政治',
  ENFJ:'培訓、諮詢、教育、新聞傳播、公共關係、文化藝術',
  ENFP:'無特定',
  ISTJ:'工商業領域、政府機構 金融銀行業、政府機構、技術領域、醫務領域',
  ISTP:'技術領域 證券、金融業、貿易、商業領域 戶外、運動、藝術',
  ISFJ:'醫護領域、消費類商業、服務業領域',
  ISFP:'手工藝、藝術領域、醫護領域、商業、服務業領域',
  INTJ:'科研、科技應用、技術咨詢、管理咨詢、金融、投資領域、創造性行業',
  INTP:'計算機技術 理論研究、學術領域 專業領域 創造性領域',
  INFJ:'咨詢、教育、科研等領域 文化、藝術、設計',
  INFP:'創作性、藝術類、教育研究、諮詢類',
};

